"use strict";
// ======================================================================================================================
console.log('=========================================================================================================');
// ======================================================================================================================
// Відео 1
// Варіант №1:
console.log('35' + - '22');
// Варіант №2:
console.log('35' * "22");
// Варіант №3:
// console.log('558' > 22++);
// Варіант №4:
let userCounter = 0;
let newUser = userCounter++;
console.log(newUser);
// Варіант №5:
console.log(!false && 11 || 18 && !'');
// Варіант №6:
let name = 0;
console.log(name ?? "Без імені");
// ======================================================================================================================
console.log('=========================================================================================================');
// ======================================================================================================================
// Відео 2
// Варіант №1:
if (1 === '1') {
    console.log('Істина!');
} else {
    console.log('Брехня!');
}
// Варіант №2:
if (5 == '5') {
    console.log('Істина!');
} else {
    console.log('Брехня!');
}
// Варіант №3:
let message = (92 > '11' && 58 < 100) ? 'Істина!' : 'Брехня!';
console.log(message);
// Варіант №4:
if (0) {
    console.log('Брехня!');
} else if (" "){
    console.log('Істина!');
}
// ======================================================================================================================
console.log('=========================================================================================================');
// ======================================================================================================================
// Відео 3
// Задача 1
let num = 0;
while(num < 5){
    num++
    console.log(num);
}

num = 1;

do {
    console.log(num);
    num++
} while (num <= 5);

for(let i = 1; i <= 5; i++){
    console.log(i);
}
// Задача 3
num = 0;
while (num < 3){
    console.log(`Число: ${num}`);
    num++;
};

// Задача 4
firstFor: for (num = 0; num < 2; num++) {
    for (let size = 0; size < 3; size++) {
        console.log(size);
        if (size === 1) {
            console.log(`Головний цикл був закінчен, коли змінна size стала дорівнювати: ${size}`);
            break firstFor;
        }
    }
}
// ======================================================================================================================
console.log('=========================================================================================================');
// ======================================================================================================================
// Відео 4
// Задача 1
let numOne = Math.round((1.005 + Number.EPSILON) * 100) / 100;
console.log(numOne);

// Задача 2
let value = "135.58px";
value = parseFloat(value);
console.log(value);

// Задача 3
value = 58 + "Фрілансер";
if (isNaN(value)) {
    console.log('Результат виразу NaN');
}

// Задача 3
console.log(Math.max(10, 58, 39, -150, 0));

// Задача 4
num = 58.858
console.log(Math.floor(num));

// ======================================================================================================================
console.log('=========================================================================================================');
// ======================================================================================================================
// Відео 5
// Задача 2
let text = 'фрілансер';
console.log(text[5]);

// Задача 4
console.log(text.toUpperCase());

// Задача 5
console.log(text.slice(3, 6));
